export type MapObject = {
    id: string;
    title: string;
    address: string;
    coords: number[];
    doc?: string;
    products?:
        {
            title: string;
            add?: string[];
        }[]
}
export const carriers: MapObject[] = [
    {
        id: '1',
        title: 'Новосоратовское-1 (мяглово)',
        address: 'ЛО, Всеволожский район,Свердловское',
        coords: [59.832140, 30.705056],
        doc: '/wp-content/themes/default/novosaratov.pdf',
        products: [
            {
                title: 'Песок карьерный',
                add: ['Мк = 1.0-1.4', 'Кф > 0.5']
            }
        ]
    },
    {
        id: '14',
        title: '«33-й км»',
        address: 'Ленинградская область, Всеволожский р-н, карьер 33 км',
        coords: [59.911877, 30.860084],
        doc: '/wp-content/themes/default/33km.pnf',
        products: [
            {
                title: 'Песок карьерный',
                add: ['Мк = 0,95']
            },
        ]
    },
    {
        id: '15',
        title: 'Манушкино',
        address: 'Ленинградская область, Всеволожский р-н, карьер Манушкино',
        coords: [59.867394, 30.785251],
        doc: '/wp-content/themes/default/manushkino.pdf',
        products: [
            {
                title: 'Песок карьерный',
                add: ['Мк = 0,95']
            },
            {
                title: 'Грунт вскрышной',
                add: []
            },
        ]
    },
    {
        id: '2',
        title: 'Залесье, участок 3',
        address: 'ЛО, Всеволожский район,Свердловское',
        coords: [59.934639, 29.235370],
        doc: '/wp-content/themes/default/zales.pdf',
        products: [
            {
                title: 'Песок обогащенный ',
                add: ['Мк = 1,2-1,2', 'Кф > 1']
            },
        ]
    },
    {
        id: '3',
        title: 'Степаново',
        address: 'ЛО, Ломоносовский район',
        coords: [59.895731, 29.455043],
        doc: '/wp-content/themes/default/stepanovo.pdf',
        products: [
            {
                title: 'Песок намывной',
                add: ['Мк 2,0-2,4']
            },
            {
                title: 'Песок намывной высший сорт',
                add: ['Мк 2,0-2,4']
            },
            {
                title: 'Валунник',
                add: []
            },
        ]
    },
    {
        id: '4',
        title: 'Краснофлотское - 2',
        address: 'ЛО, Ломоносовский район',
        coords: [59.956305, 29.303193],
        doc: '/wp-content/themes/default/krasnoflot.pdf',
        products: [
            {
                title: 'Песок карьерный',
                add: ['Мк 2,2 - 2,4']
            },
            {
                title: 'Песок намывной',
                add: ['Кф 8м.с', 'Мк: 1,5-1,8']
            }
        ]
    },
    {
        id: '16',
        title: 'Таменгонт-1 (пульмановский)',
        address: 'ЛО, Ломоносовский район',
        coords: [59.884866, 29.521488],
        doc: '/wp-content/themes/default/tamengont.webp',
        products: [
            {
                title: 'Намывной песок высшего сорта',
                add: ['Мк = 1,5 - 2,0 ', 'Кф = 3,0 - 6,0']
            },
            {
                title: 'Намывной песок 1 сорта',
                add: ['Мк = 1,0 - 1,5', 'Кф = 0,5 - 1,5']
            }
        ]
    },
    {
        id: '5',
        title: 'Малукса',
        address: 'ЛО, Кировский район',
        coords: [59.725364, 31.317403],
        doc: '/wp-content/themes/default/maluksa.pdf',
        products: [
            {
                title: 'Песок намывной',
                add: ['Мк = 0,1-0,7', 'Мк = 0,7-1,4', 'Мк = 0,7-2,0']
            },
            {
                title: 'ПГС, Гравий, ЩПС',
                add: ['Мк = 0-80']
            }
        ]
    },
    {
        id: '6',
        title: 'Путилово',
        address: 'ЛО, Кировский район',
        coords: [59.862818, 31.410401],
        doc: '/wp-content/themes/default/putilova.pdf',
        products: [
            {
                title: 'Отсев дробления фр 0-20  ',
                add: []
            },
            {
                title: 'Щебень известяковый фр. 20-40',
                add: []
            },
            {
                title: 'Щебень известяковый фр. 40-80',
                add: []
            },
            {
                title: 'Бутовый камень некалиброванный',
                add: []
            },
            {
                title: 'Бутовый камень калиброванный',
                add: []
            }
        ]
    },
    {
        id: '7',
        title: 'Отрадное',
        address: 'ЛО, Кировский район',
        coords: [59.796042, 30.869819],
        products: [
            {
                title: 'Песок намывной',
                add: []
            }
        ]
    },
    {
        id: '8',
        title: 'Горное Елохово',
        address: 'Волховский район, Потанинское с/п',
        coords: [60.275926, 32.699361],
        doc: '/wp-content/themes/default/nadino.pdf',
        products: [
            {
                title: 'Песок намывной',
                add: ['Мк = 1,2 - 2', 'Кф =2']
            },
            {
                title: 'Песок карьерный',
                add: ['Мк = 1,2 - 2', 'Кф =2']
            }
        ]
    },
    {
        id: '17',
        title: 'Александровка',
        address: 'Ленинградская область, Тосненский район, Любанское городское поселение',
        coords: [59.265380, 31.245822],
        doc: '/wp-content/themes/default/aleksandrowka.docx',
        products: [
            {
                title: 'Песок намывной',
                add: ['Мк = 1,0 - 2,5', 'Кф = 0,5 - 3,0']
            },
            {
                title: 'Грунт песчаный',
                add: []
            },
        ]
    },
    {
        id: '9',
        title: 'Надино',
        address: 'ЛО, п. Шапки ,Тосненский район',
        coords: [59.619016, 31.211578],
        doc: '/wp-content/themes/default/nadino.pdf',
        products: [
            {
                title: 'Песок сеяный 1,2 сорт',
                add: ['Мк = 1,3 - 1,8', 'Кф = 1 - 1,5']
            },
            {
                title: 'Песок карьерный',
                add: ['Мк = 1,3 - 1,8', 'Кф = 1 - 1,5']
            },
            {
                title: 'Грунт плодородный',
                add: ['Мк = 1,3 - 1,8', 'Кф = 1 - 1,5']
            },
        ]
    },
    {
        id: '10',
        title: 'Полигон Уролище',
        address: 'ЛО, Первомайское сельское поселение, Выборгский район',
        coords: [60.396434, 29.920330],
        doc: '/wp-content/themes/default/nadino.pdf',
        products: [
            {
                title: 'Песок сеяный',
                add: ['Мк = 0,5 - 2,5', 'Кф = 1 - 3']
            },
            {
                title: 'Песок карьерный',
                add: ['Мк = 0,5 - 2,5', 'Кф = 1 - 3']
            },
            {
                title: 'Гравий 5-20',
            },
            {
                title: 'Гравий 20-40',
            },
            {
                title: 'Гравий 0 -300',
            },
        ]
    },
    {
        id: '11',
        title: 'Кудлей',
        address: 'ЛО, Первомайское сельское поселение, Выборгский район',
        coords: [60.308449, 29.730743],
        doc: '/wp-content/themes/default/kudley.webp',
        products: [
            {
                title: 'Песок карьерный 1 сорта',
                add: ['Мк = 0,1 - 2,0', 'Кф = 1 - 6']
            },
            {
                title: 'Песок карьерный 4 сорта',
                add: ['Мк = 0,1 - 2,0', 'Кф = 1 - 6']
            },
        ]
    },
    {
        id: '12',
        title: 'Майский',
        address: 'Первомайское сельское поселение, Выборгский район, Ленинградская область',
        coords: [60.378468, 29.898921],
        doc: '/wp-content/themes/default/mayski.xlsx',
        products: [
            {
                title: 'Песок  мелкозенистый',
                add: ['Мк = 1,5 - 1,9', 'Кф > 1 м/сут']
            },
            {
                title: 'Песок карьерный',
                add: ['Мк = 2,1 - 2,6', 'Кф > 2 м/сут']
            },
            {
                title: 'Песок сеяный',
                add: ['Мк =  2,2 - 2,5', 'Кф > 2 м/сут']
            },
        ]
    }
]

export const polygon: MapObject[] = [
    {
        id: '25',
        title: 'Новый Свет-эко',
        address: 'Ленинградская область, Гатчинский район, Новосветское сельское поселение',
        coords: [59.582500, 30.210692],
    },
    {
        id: '13',
        title: 'Полигон твердных бытовых отходов Южный',
        address: 'Ленинградская область, Ломоносовский район, Виллозское городское поселение, территория Цветы',
        coords: [59.753716, 30.274168],
    },
    {
        id: '18',
        title: 'Полигон отходов Северная Самарка',
        address: 'Ленинградская область, Всеволожский район, деревня Самарка',
        coords: [59.851973, 30.691575],
    },
    {
        id: '19',
        title: 'Омега',
        address: 'Бугровское сельское поселение, Всеволожский район, Ленинградская область',
        coords: [60.109961, 30.420081],
    },
    {
        id: '20',
        title: 'Куньголово',
        address: 'Тосненское городское поселение, Ленинградская область',
        coords: [59.545653, 30.660156],
    },
    {
        id: '21',
        title: 'Манушкино',
        address: 'Ленинградская область, Всеволожский р-н',
        coords: [59.867394, 30.785251],
        doc: '/wp-content/themes/default/manushkino.pdf'
    },
    {
        id: '22',
        title: '33-км',
        address: 'Ленинградская область, Всеволожский р-н',
        coords: [59.910793, 30.860556],
    },
    {
        id: '23',
        title: 'Красный Бор',
        address: 'Красноборское городское поселение, Тосненский район, Ленинградская область',
        coords: [59.708611, 30.704167],
    },
    {
        id: '24',
        title: 'Полигон твердых бытовых отходов',
        address: 'Санкт-Петербург, Кировский район, муниципальный округ Ульянка',
        coords: [59.818834, 30.156719],
    }
]