export const tableItems = [
  {
    title: 'Отсыпка участков',
    items: [
      'Выравнивание и очистка территории',
      'Поднятие/отсыпка участка',
      'Проектирование и планировка участка',
      'Установка дренажных систем',
      'Обратная засыпка',
    ],
  },
  {
    title: 'Разработка котлованов',
    items: [
      'Разработка котлована механизированным способом',
      'Планировка территории',
      'Вывоз грунта',
      'Вывоз грунта с утилизацией',
      'Справки об утилизации грунт V класса опасности',
      'Протокол биотестирования',
    ],
  },
  {
    title: 'Строительство дорог и площадок',
    items: [
      'Отсыпка площадок, парковок',
      'Временные дороги',
      'Дороги и площадки из дорожных плит',
      'Укладка асфальтовой крошки',
      'Асфальтирование площадок',
      'Ремонт дорог'
    ],
  },
  {
    title: 'Строительство ангаров под ключ',
    items: [
      'Проектирование',
      'Изготовление',
      'Нанесение защитных покрытий',
      'Устройство инженерных сетей',
      'Монтаж сэндвич-панелей',
      'Устройство фундаментов',
      'Монтаж металлоконструкций',
      'Монтаж профлиста',
      'Устройство кровель из ПВХ мембраны',
      'Монтаж фасонных элементов',
    ],
  },
];
